tutorials/multiphase/compressibleInterFoam/depthCharge3D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 2 0)
    (0 2 0)
    (0 0 1)
    (1 0 1)
    (1 2 1)
    (0 2 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (80 160 80) simpleGrading (1 1 1)
);

patches
(
    wall walls
    (
        (3 7 6 2)
        (0 4 7 3)
        (2 6 5 1)
        (1 5 4 0)
        (0 3 2 1)
        (4 5 6 7)
    )
);

// ************************************************************************* //
